ws_1c_edt/ws_admin/src/Catalogs/УчетныеЗаписиПользователей/УчетныеЗаписиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиПользователей</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ws_1c_edt/ws_admin/src/CommonModules/ОбщегоНазначения/Module.bsl
Процедура УстановитьПараметрыСеанса() Экспорт
	
	ПараметрыСеанса.ИдентификаторПриложения = Новый УникальныйИдентификатор();

	Если СокрЛП(Константы.Сервер.Получить()) <> "" Тогда
		ПараметрыСеанса.ВебСокетСервер = Константы.Сервер.Получить();	
	Иначе
		ПараметрыСеанса.ВебСокетСервер = "127.0.0.0"
	КонецЕсли;
	
	Если Константы.Порт.Получить() > 0 Тогда
		ПараметрыСеанса.ПортВебСокетСервера = Константы.Порт.Получить();
	Иначе
		ПараметрыСеанса.ПортВебСокетСервера = 8080;
	КонецЕсли;
	

КонецПроцедуры

Функция ПолучитьНастройкиПодключения() Экспорт
	
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("UUID", Строка(ПараметрыСеанса.ИдентификаторПриложения));
	СтруктураРезультат.Вставить("Сервер", ПараметрыСеанса.ВебСокетСервер);
	СтруктураРезультат.Вставить("Порт", ПараметрыСеанса.ПортВебСокетСервера);
	
	Возврат СтруктураРезультат;
	
КонецФункции

Функция ПолучитьДанныеУчетнойЗаписи(ВыбПользователь = Неопределено) Экспорт

	Если ВыбПользователь = Неопределено Тогда
		ВыбПользователь = ПользователиСервер.АвторизованныйПользователь();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	Справочник.УчетныеЗаписиПользователей КАК УчетныеЗаписиПользователей
		|ГДЕ
		|	УчетныеЗаписиПользователей.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ВыбПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураУчетнойЗаписи = Новый Структура();
	СтруктураУчетнойЗаписи.Вставить("Пользователь", СокрЛП(ВыбПользователь));
	СтруктураУчетнойЗаписи.Вставить("Пароль", "");
	СтруктураУчетнойЗаписи.Вставить("ИдентификаторПользователя", "");
	СтруктураУчетнойЗаписи.Вставить("Имя", ВыбПользователь.Код);
	СтруктураУчетнойЗаписи.Вставить("Представление", "");
			
	Если Выборка.Следующий() Тогда
		СтруктураУчетнойЗаписи.Пароль = Выборка.Пароль;
		СтруктураУчетнойЗаписи.ИдентификаторПользователя = XMLСтрока(ВыбПользователь);
		//СтруктураУчетнойЗаписи.Представление = Выборка.Представление;
	КонецЕсли;

	Возврат СтруктураУчетнойЗаписи;

КонецФункции
